import type { Preset } from '@shared/types';

export function getDefaultPreset(): Preset {
  return {
    categories: [
    {
      id: 'cat-1',
      name: 'Кіно та Серіали',
      questions: [
        { id: 'q-1-100', value: 100, questionText: 'Він зіграв роль Джека Горобця у франшизі "Пірати Карибського моря"', answerText: 'Джонні Депп' },
        { id: 'q-1-200', value: 200, questionText: 'Який фільм 2023 року про фізика-теоретика отримав Оскар за найкращий фільм?', answerText: 'Оппенгеймер' },
        { id: 'q-1-300', value: 300, questionText: 'Цей серіал Netflix став найпопулярнішим неанглійським шоу, де грали в смертельні дитячі ігри', answerText: 'Гра в кальмара' },
        { id: 'q-1-400', value: 400, questionText: 'Хто режисер культового науково-фантастичного фільму "Інтерстеллар"?', answerText: 'Крістофер Нолан' },
        { id: 'q-1-500', value: 500, questionText: 'Який фільм Джеймса Кемерона є найкасовішим фільмом усіх часів?', answerText: 'Аватар' },
      ]
    },
    {
      id: 'cat-2',
      name: 'Історія та Географія',
      questions: [
        { id: 'q-2-100', value: 100, questionText: 'В якій європейській країні розташована знаменита Ейфелева вежа?', answerText: 'Франція' },
        { id: 'q-2-200', value: 200, questionText: 'Ця африканська річка вважається найдовшою у світі', answerText: 'Ніл' },
        { id: 'q-2-300', value: 300, questionText: 'В якому році Україна проголосила свою незалежність?', answerText: '1991' },
        { id: 'q-2-400', value: 400, questionText: 'Яке італійське місто було столицею Стародавньої Римської імперії?', answerText: 'Рим' },
        { id: 'q-2-500', value: 500, questionText: 'Який найменший океан на Землі за площею територій?', answerText: 'Північний Льодовитий океан' },
      ]
    },
    {
      id: 'cat-3',
      name: 'Наука та Технології',
      questions: [
        { id: 'q-3-100', value: 100, questionText: 'Яка планета Сонячної системи є найближчою до Сонця?', answerText: 'Меркурій' },
        { id: 'q-3-200', value: 200, questionText: 'Який хімічний елемент позначається літерою "O" в періодичній таблиці?', answerText: 'Кисень' },
        { id: 'q-3-300', value: 300, questionText: 'Хто є засновником компаній SpaceX та Tesla?', answerText: 'Ілон Маск' },
        { id: 'q-3-400', value: 400, questionText: 'Як називається процес, за допомогою якого рослини перетворюють світло в енергію?', answerText: 'Фотосинтез' },
        { id: 'q-3-500', value: 500, questionText: 'Яка швидкість світла у вакуумі (округлено в км/с)?', answerText: '300 000 км/с' },
      ]
    },
    {
      id: 'cat-4',
      name: 'Відеоігри',
      questions: [
        { id: 'q-4-100', value: 100, questionText: 'Цей водопровідник у червоному капелюсі є офіційним талісманом компанії Nintendo', answerText: 'Маріо' },
        { id: 'q-4-200', value: 200, questionText: 'Як називається найпопулярніша пісочниця у світі, весь всесвіт якої складається з кубів?', answerText: 'Minecraft' },
        { id: 'q-4-300', value: 300, questionText: 'Головний герой відомої серії ігор та книг "The Witcher" (Відьмак)', answerText: 'Геральт з Рівії' },
        { id: 'q-4-400', value: 400, questionText: 'Яка домашня консоль від Sony стала найпродаванішою ігровою консоллю в історії?', answerText: 'PlayStation 2' },
        { id: 'q-4-500', value: 500, questionText: 'Ця масштабна RPG-гра 2023 року від Larian Studios виграла нагороду "Гра Року" (GOTY)', answerText: "Baldur's Gate 3" },
      ]
    },
    {
      id: 'cat-5',
      name: 'Загальні Питання',
      questions: [
        { id: 'q-5-100', value: 100, questionText: 'Скільки днів налічує календарний рік під час високосного року?', answerText: '366' },
        { id: 'q-5-200', value: 200, questionText: 'Який додатковий колір виходить при змішуванні синього та жовтого кольорів?', answerText: 'Зелений' },
        { id: 'q-5-300', value: 300, questionText: 'Яка тварина є найбільшим ссавцем (та взагалі твариною) на нашій планеті?', answerText: 'Синій кит' },
        { id: 'q-5-400', value: 400, questionText: 'Який класичний клавішний музичний інструмент має рівно 88 клавіш?', answerText: 'Піаніно' },
        { id: 'q-5-500', value: 500, questionText: 'Хто написав легендарну романтичну трагедію "Ромео і Джульєтта"?', answerText: 'Вільям Шекспір' },
      ]
    }
  ]
  };
}
